import datetime

def lesson():
    dict = [
        {"Название":"176128", "Категория":"Music","Главная категория":"Music","Валюта":"USD", "Дедлайн":"2013-01-10","Дата публикации":"2012-12-09", "таргет2":625.0,"Цель в долларах":1000.0,"таргет1":0.0,"Срок":39,"Год публикации":2009,"rent":200},
        {"Название":"241929", "Категория":"Games","Главная категория":"Games","Валюта":"USD", "Дедлайн":"2012-04-29","Дата публикации":"2012-03-30", "таргет2":22.0,"Цель в долларах":80000.0,"таргет1":0.0,"Срок":87,"Год публикации":2009,"rent":300},
        {"Название":"244460", "Категория":"Accessories","Главная категория":"Fashion","Валюта":"KZT", "Дедлайн":"2017-07-22","Дата публикации":"2017-05-23", "таргет2":35.0,"Цель в долларах":20.0,"таргет1":1.0,"Срок":8,"Год публикации":2009,"rent":5},
        {"Название":"80845", "Категория":"Accessories","Главная категория":"Fashion","Валюта":"USD", "Дедлайн":"2016-11-18","Дата публикации":"2016-10-19", "таргет2":145.0,"Цель в долларах":99.0,"таргет1":1.0,"Срок":79,"Год публикации":2009,"rent":20},
        {"Название":"181197", "Категория":"Food","Главная категория":"Food","Валюта":"RUB", "Дедлайн":"2015-05-17","Дата публикации":"2015-04-17", "таргет2":387.0,"Цель в долларах":1900.0,"таргет1":0.0,"Срок":28,"Год публикации":2009,"rent":300}
    ]
    # цель/срок - таргет2/срок -(rent/30)*срок  <0 false : true
    # дедлайн 2015-12-31
    # дата публикации 2015-10-11
    # срок = дедлайн - дата публикации

    dict.append({"Название":"181197", "Категория":"Food","Главная категория":"Food","Валюта":"RUB", "Дедлайн":"2015-05-17","Дата публикации":"2015-04-17", "таргет2":387.0,"Цель в долларах":1900.0,"Срок":28,"Год публикации":2009,"rent":300})
    aim = (dict[-1]["Цель в долларах"] / dict[-1]["Срок"] -

        dict[-1]["таргет2"] / dict[-1]["Срок"] - (dict[-1]["rent"] / 30) * dict[-1]["Срок"])

    if aim < 0:
        dict[-1]["таргет1"] = 0
    else:
        dict[-1]["таргет1"] = 1

    for i in dict:
        print(i)

lesson()